---
kind: method
id: M:Autodesk.Revit.DB.Lighting.RectangleLightShape.#ctor(Autodesk.Revit.DB.Lighting.RectangleLightShape)
source: html/bdc695a2-882b-4ceb-df16-b1839a1e0db2.htm
---
# Autodesk.Revit.DB.Lighting.RectangleLightShape.#ctor Method

Creates a copy of the given rectangle light shape

## Syntax (C#)
```csharp
public RectangleLightShape(
	RectangleLightShape other
)
```

## Parameters
- **other** (`Autodesk.Revit.DB.Lighting.RectangleLightShape`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null